import React, { Component } from 'react';

class Traditions extends Component {
    constructor(props) {
        super(props);
        this.state = {
            isMore: false
        }
    }
    
    render() {
        const values = [
            'Ця продукція виготовляється без будь-яких шкідливих для організму домішок, у ній значно менший вміст солі у порівнянні з європейськими технологіями. А батони тут печуть на натуральній олії. Крім того, ТДВ\"Поліссяхліб\" принципово працює тільки на відчизняному обладнанні. Це дає змогу забезпечити зберігання всіх смакових якостей справжнього хліба. З цього приводу існує навіть гасло - \"Традиції збережено!\". Повний цикл приготовлення становить 8 годин, що забезпесує рум\'яну скоринку та духмяний м\'якуш. На цьому підприємстві повернулися до старовинних рецептів приготування тіста на густих опарах. Завдяки цьому хліб набуває приємного аромату, м\'якуш стає більш еластичним і об\'ємним. ',
            'Працівники підприємства не тільки бережуть традиції нашого народу, які формувалися віками, а й примножують їх. Наприклад, житньо-пшеничні види хліба - \"Колосковай\" і \"Козацікий\" - припали до смаку Рівнянам відразу ж, - як тільки з\'явилися на полицях фірмового магазину \"Колосок\" та в спеціалізованих кіосках - \"Колосочок\". ',
            'Уся продукція виготовляється з використанням винятково натуральних харчових інгрідієнтів (без хімічних добавок, розрихлювачів), за умови суворого дотримання санітарно-гігієнічних вимог. У атестованій лабораторії підприємства, 4-8 разів за зміну контролюється якість хлібо-булочних виробів. Ведеться також суворий контроль сировини, що надходить на хлібозавод. Зараз у товаристві впроваджується система управління якістб ISO - 9001. Отож, Придбавши хліб, булки й кондитерські вироби ТДВ \"Поліссяхліб\", ви будите задоволені їх смаком, свіжістю і ціною. '
        ]
        const principles = [
            'Натуральна сировина',
            'старовинні рецепти',
            'екологічно чиста вода',
            'традицйні технології',
            'тепло людських рук',
        ]
        return (
            <div className="traditions container">
                <div className="title">
                    <h1>Традиції збережено</h1>
                    <div className="hr"></div>
                </div>
                <div className="values-box">
                    <div className="principles-box">
                        <div className="title">
                            <span className="text">
                                При випічці хлібобулочних виробів працівники ТДВ "Поліссяхліб" дотримуються п'яти принципів:
                            </span>
                        </div>
                        <div className="principles-wrapper grid">
                            {
                                principles.map((v, i)=>{
                                    return (
                                        <div key={i} className="principe">
                                            <span className="text">
                                            {
                                                v
                                            }
                                            </span>
                                        </div>
                                    );
                                })
                            }
                        </div>
                    </div>
                    <div className="values-wrapper grid">
                        {
                            values.map((v, i)=>{
                                return (
                                    <div key={i} className="value">
                                        <span className="text">
                                            {
                                                v
                                            }
                                        </span>
                                        <div className="hr"></div>
                                    </div>
                                );
                            })
                        }
                    </div>
                </div>
            </div>
        );
    }
}

export default Traditions;