import React from 'react';


const Future = () => {
    const values = [
        'На підприємстві постійно реконструюються технологічні лінії, модернізують обладнання, розширюють асортимент продукції, вдосконалюють її якість. Колишній хлібозавод за останні десять років перетворився на сучасне харчове підприємство, про яке добре знають рівняни, бо залюбки споживають його продукцію. І все це завдяки наполегливій праці всього колективу, вмінню господарювати, йдучи в ногу з часом. Кредо кервника - йти вперед, інакше тебе випередять інші. ',
        'У кабінеті голови правління ТДВ \"Поліссяхліб\" багато нагород: грамоти, дипломи, подяки за сумлінну працю і колективу підприємства, і особисто його керівнику. Кожну таку відзнаку тут сприймають як аванс на майбутнє. А найвищою нагородою для підприємства є те, що серед різноманіття хлібобулочних виробів, споживачі обирають саме продукцію \"Поліссяхліб\". У найближчих планах підприємства - робота над упаковкою та розширення асортименту. Усе це, а також віра у щасливе майбутнє дозволяють ТДВ \"Поліссяхліб\" і надалі залишатися лідером на ринку харчової промисловості Рівненської області.'
    ]
    return (
        <div className="future container">
            <div className="title">
                <h1>Погляд у майбутнє</h1>
                <div className="hr"></div>
            </div>
            <div className="values-box grid">
                {
                    values.map((v, i)=>{
                        return (
                        <div key={i} className="value-wrapper">
                            <span className="value">
                                {
                                    v
                                }
                            </span>
                        </div>
                        );
                    })
                }
            </div>
        </div>
    );
}

export default Future;