import  React, { Component } from 'react';

class Success extends Component {
    constructor(props) {
        super(props);
        this.state = {
            isMore: false
        }
    }
    

    render() {
        const values = [
            'Одним з найголовніших напрямків ТДВ \"Поліссяхліб\" є забезпечення належних умов роботи персоналу. Керівництво підприємства на чолі з головою правління намагається зробити все, щоб кожен з трьох сотень працівників відчув себе повністю захищеним як в моральному, так і в матеріальному плані. Рівень заробітної плати на сьогодні є одним з найвищих порівняно з іншими підприємствами Рівненської області. Відпрацьована також система фінансового заохочення та виплат матеріальної допомоги тим працівникам, які її потребують.',
            'Персонал підприємства впевнений у майбутньому. Цю впевненість вселяє те, що осі уже більше десятка років \"Поліссяхліб\" працює стабільно. Створені умови не лише для праці, а й для добробуту працівників. До послуг працівників сучасні, комфортні душові, кімнати побуту, їдільня. Тож і плинності кадрів тут немає, а середній вік колективу до 40 років. Працівники ТДВ \"Поліссяхліб\" з повною відповідальністю ставляться до роботи. Найкращим доказом цього є постійний попит на продукцію підприємства.',
            'На запитання про секрет успіху підприємства його керівник переконливо стверджує: \"Головне - це забезпечення належних умов праці, достойного морального та матеріального захисту працівників. Адже в кожного з них є душа, сім\'я, особисті проблеми. Людина - це найвище...\" ',
            'За той час відколи підприємство очолив Віктор Нагорнюк, тут створено 130 робочих місць. Службовці та спеціалісти працюють у кабінетах, обладнаних сучасними меблями, їхні робочі місця комп\'ютеризовані. Обладнаний комп\'ютерною технікою і відділ збуту, що полегшує ведення обліку і звітності. Оновлений автопарк нараховує понад два десятки автомобілів, що дає змогу вчасно доставляти свіжу продукцію в торгівельну мережу міста та області.'
        ]
        return (
            <div className="success container">
                <div className="title">
                    <h1>Запорука успіху</h1>
                    <div className="hr"></div>
                </div>
                <div className="values-box">
                    <div className="values-wrapper grid">
                    {
                        values.map((v, i)=>{
                            return (
                                <div key={i} className="value">
                                    <span className="text">
                                        {
                                            v
                                        }
                                    </span>
                                    <div className="hr"></div>
                                </div>
                            );
                        })
                    }
                    </div>
                </div>
            </div>
        );
    }
}

export default Success;